In [8]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [9]:
dataset = [8,9,2,10,3,5,7,12,15]

In [10]:
Q1 = np.percentile(dataset,25)

In [11]:
Q1

5.0

In [12]:
Q2 = np.percentile(dataset,50)

In [13]:
Q2

8.0

In [14]:
Q3 = np.percentile(dataset,75)
Q3

10.0

In [15]:
df = pd.read_excel("shop.xlsx")

In [16]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [17]:
df.shape

(50, 5)

In [18]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [19]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [24]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

# Normalization

In [44]:
from sklearn.preprocessing import MinMaxScaler
mm = MinMaxScaler(feature_range=(0,1))

In [45]:
df1.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         4.077850        3.955232   5.000000    Dhaka  5.000000
1         4.950078        4.285915   4.822680      Ctg  4.992064
2         4.783954        3.138737   4.593991  Rangpur  4.979534
3         4.619409        3.538995   4.436705    Dhaka  4.841877
4         4.578313        2.915984   4.328407  Rangpur  4.559514

In [46]:
df1['Marketing Spend'] = mm.fit_transform(df1[["Marketing Spend"]])

In [47]:
df1.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        3.955232   5.000000    Dhaka  5.000000
1         0.983359        4.285915   4.822680      Ctg  4.992064
2         0.927985        3.138737   4.593991  Rangpur  4.979534
3         0.873136        3.538995   4.436705    Dhaka  4.841877
4         0.859438        2.915984   4.328407  Rangpur  4.559514

In [48]:
df1['Administration'] = mm.fit_transform(df1[["Administration"]])

In [49]:
df1['Transport'] = mm.fit_transform(df1[["Transport"]])

In [50]:
df1['Profit'] = mm.fit_transform(df1[["Profit"]])

In [51]:
df1.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.651744   1.000000    Dhaka  1.000000
1         0.983359        0.761972   0.940893      Ctg  0.997355
2         0.927985        0.379579   0.864664  Rangpur  0.993178
3         0.873136        0.512998   0.812235    Dhaka  0.947292
4         0.859438        0.305328   0.776136  Rangpur  0.853171

# Standardization

In [52]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()

In [53]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [54]:
df2['Marketing Spend'] = ss.fit_transform(df2[["Marketing Spend"]])
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [57]:
df2['Administration'] = ss.fit_transform(df2[["Administration"]])

In [58]:
df2['Transport'] = ss.fit_transform(df2[["Transport"]])

In [59]:
df2['Profit'] = ss.fit_transform(df2[["Profit"]])

In [60]:
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913        0.560753   2.165287    Dhaka  2.011203
1         1.955860        1.082807   1.929843      Ctg  1.999430
2         1.754364       -0.728257   1.626191  Rangpur  1.980842
3         1.554784       -0.096365   1.417348    Dhaka  1.776627
4         1.504937       -1.079919   1.273550  Rangpur  1.357740

# Robust Scaler

In [63]:
from sklearn.preprocessing import RobustScaler
rs = RobustScaler()

In [64]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [65]:
df3['Marketing Spend'] = rs.fit_transform(df3[["Marketing Spend"]])
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530       136897.80  471784.10    Dhaka  192261.83
1         1.452113       151377.59  443898.53      Ctg  191792.06
2         1.303634       101145.55  407934.54  Rangpur  191050.39
3         1.156567       118671.85  383199.62    Dhaka  182901.99
4         1.119836        91391.77  366168.42  Rangpur  166187.94

In [66]:
df3['Administration'] = rs.fit_transform(df3[["Administration"]])

In [69]:
df3['Transport'] = rs.fit_transform(df3[["Transport"]])

In [70]:
df3['Profit'] = rs.fit_transform(df3[["Profit"]])

In [71]:
df3.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.672530        0.345355   1.552016    Dhaka  1.698340
1         1.452113        0.697565   1.383714      Ctg  1.688874
2         1.303634       -0.524290   1.166654  Rangpur  1.673929
3         1.156567       -0.097977   1.017368    Dhaka  1.509736
4         1.119836       -0.761543   0.914576  Rangpur  1.172943

# Max Absolute Scaler

In [73]:
from sklearn.preprocessing import MaxAbsScaler
mas = MaxAbsScaler()

In [74]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [75]:
df4['Marketing Spend'] = mas.fit_transform(df4[["Marketing Spend"]])
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [77]:
df4['Administration'] = mas.fit_transform(df4[["Administration"]])

In [78]:
df4['Transport'] = mas.fit_transform(df4[["Transport"]])

In [79]:
df4['Profit'] = mas.fit_transform(df4[["Profit"]])

In [80]:
df4.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.749527   1.000000    Dhaka  1.000000
1         0.983359        0.828805   0.940893      Ctg  0.997557
2         0.927985        0.553781   0.864664  Rangpur  0.993699
3         0.873136        0.649738   0.812235    Dhaka  0.951317
4         0.859438        0.500378   0.776136  Rangpur  0.864383